---
title: ConnectionInputPoint
classe: Autodesk.Revit.DB.Structure.ConnectionInputPoint
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ConnectionInputPoint

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Guid Id { get; set; }` | `connectionInputPoint.Id` | Guid |
| `Boolean IsValidObject { get; }` | `connectionInputPoint.IsValidObject` | Boolean |
| `XYZ Point { get; set; }` | `connectionInputPoint.Point` | XYZ |
| `Void Dispose()` | `connectionInputPoint.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```